БухЭксп/InformationRegisters/CW_МенеджерыПродажКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_МенеджерыПродажКлиентов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_МенеджерыПродажКлиентов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьМенеджераКлиента(СтруктураПараметров) Экспорт
	
	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_МенеджерыПродажКлиентовСрезПоследних.МенеджерПродаж КАК МенеджерПродаж
	               |ИЗ
	               |	РегистрСведений.CW_МенеджерыПродажКлиентов.СрезПоследних(&ДатаСреза, Контрагент = &Контрагент) КАК CW_МенеджерыПродажКлиентовСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза"	, ?(ЗначениеЗаполнено(СтруктураПараметров.ДатаСреза),СтруктураПараметров.ДатаСреза , ТекущаяДата()));
	Запрос.УстановитьПараметр("Контрагент"	, СтруктураПараметров.Контрагент);
	
	Выборка  = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МенеджерПродаж;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
#КонецЕсли
